[
    {
        "title": "",
        "link": "https://news.stanford.edu/stories/2022/06/biotechnology-incubator-stanford-research-park-anchors-growing-life-sciences-district",
        "snippet": "",
        "newsletter_link": "https://news.stanford.edu/subscribe"
    },
    {
        "title": "Harvard Innovation Labs",
        "link": "https://innovationlabs.harvard.edu/",
        "snippet": "The Pagliuca Harvard Life Lab is a state-of-the-art wet laboratory and co-working space for high-potential biotech and life science ventures at Harvard. Turn your ideas into impact. We …",
        "newsletter_link": "https://innovationlabs.harvard.edu/press-13"
    },
    {
        "title": "Babson Build: An Entrepreneurship Program for University …",
        "link": "https://www.babson.edu/professional/entrepreneurship-education/student-programs/babson-build/",
        "snippet": "Babson Build is an experiential program designed to help university students think and act entrepreneurially. With dedicated tracks for both undergraduate and graduate students, …",
        "newsletter_link": "mailto:babsonacademy@babson.edu"
    },
    {
        "title": "Innovation and Entrepreneurship | University of California",
        "link": "https://www.universityofcalifornia.edu/for-california/research/innovation-and-entrepreneurship",
        "snippet": "Sep 14, 2023 · With the acquisition, UCLA will create an engine of innovation, discovery and economic growth for Southern California and beyond.",
        "newsletter_link": "https://www.universityofcalifornia.edu/for-california/research/innovation-and-entrepreneurship"
    },
    {
        "title": "Entrepreneurship Hub | UCLA | UCLA",
        "link": "https://www.ucla.edu/academics/support/entrepreneurship",
        "snippet": "Explore the extensive resources within our major startup hubs on campus. With renowned faculty, accomplished alumni, and state-of-the-art technologies, UCLA drives groundbreaking …",
        "newsletter_link": "https://signup.e2ma.net/signup/1981088/1808790/"
    },
    {
        "title": "Future-Proofing with Tech: How the Technology Management …",
        "link": "https://sps.columbia.edu/news/future-proofing-tech-how-technology-management-program-curriculum-evolves-rapidly-advancing",
        "snippet": "Jun 26, 2024 · Generative AI is redefining the shape and speed of innovation. Columbia’s Master of Science in Technology Management program prepares technology professionals to future …",
        "newsletter_link": "https://sps.columbia.edu/news/future-proofing-tech-how-technology-management-program-curriculum-evolves-rapidly-advancing"
    },
    {
        "title": "Columbia Venture Partners",
        "link": "http://www.columbiaventurepartners.org/",
        "snippet": "Columbia Venture Partners (CVP) is Columbia’s first and leading venture capital initiative for the undergraduate student body. We aim to bring hands-on learning opportunities from the …",
        "newsletter_link": "https://columbiaventures.us1.list-manage.com/subscribe?id=8f75b41761&u=6a05a0a07c43491c4070c3e25"
    },
    {
        "title": "Home - Polsky Center for Entrepreneurship and Innovation",
        "link": "https://polsky.uchicago.edu/",
        "snippet": "The Polsky Exchange is a 34,000-square-foot startup incubator space for fostering economic development and supporting small business owners and founders on the South and West …",
        "newsletter_link": "https://polsky.uchicago.edu/polsky-center-newsletters/"
    },
    {
        "title": "UChicago Startup Investment Program - Polsky Center for ...",
        "link": "https://polsky.uchicago.edu/programs-events/uchicago-startup-investment-program/",
        "snippet": "The UChicago Startup Investment Program is a new initiative where the University of Chicago co-invests alongside established venture funds in startups led by UChicago faculty, students, staff …",
        "newsletter_link": "mailto:polsky@uchicago.edu"
    },
    {
        "title": "New Venture Challenge - Polsky Center for Entrepreneurship and …",
        "link": "https://polsky.uchicago.edu/programs-events/new-venture-challenge/",
        "snippet": "The founders of those and other successful companies delve into their entrepreneurial journeys in a podcast series to mark the 25th anniversary of the Edward L. Kaplan, ’71, New Venture …",
        "newsletter_link": "mailto:polsky@uchicago.edu"
    },
    {
        "title": "Edge Entrepreneurship - UChicago's Entrepreneurship Club",
        "link": "https://www.uchicagoedge.org/",
        "snippet": "Edge Entrepreneurship, previously Rockefellar Business Management, is UChicago's Premier Undergraduate Entrepreneurship RSO since 2011. We provide resources, mentorship, and …",
        "newsletter_link": "mailto:uchicagoedge@gmail.com"
    },
    {
        "title": "Entrepreneurship and Venture Capital - Polsky Center for ...",
        "link": "https://polsky.uchicago.edu/info/college/entrepreneurship-venture-capital/",
        "snippet": "The Entrepreneur-in-Residence and Investors-in-Residence programs provide mentorship and coaching to University of Chicago students. Successful Chicago-based entrepreneurs are …",
        "newsletter_link": "https://airtable.com/shruHSl5yjpnNk40B"
    },
    {
        "title": "Market Shaping Accelerator at the University of Chicago",
        "link": "https://marketshaping.uchicago.edu/",
        "snippet": "UChicago's Market Shaping Accelerator designs market shaping mechanisms to spur innovation to help solve global challenges.",
        "newsletter_link": "https://marketshaping.uchicago.edu/"
    },
    {
        "title": "Development Innovation Lab - Development Innovation Lab",
        "link": "https://dil.uchicago.edu/",
        "snippet": "Jun 22, 2024 · Development Innovation Lab at the University of Chicago. We bring researchers in different fields together with governments, firms and non-profit organizations to identify, test, …",
        "newsletter_link": "mailto:developmentinnovationlab@uchicago.edu"
    },
    {
        "title": "College New Venture Challenge (CNVC) - Polsky Center for ...",
        "link": "https://polsky.uchicago.edu/programs-events/college-new-venture-challenge/",
        "snippet": "The College New Venture Challenge (CNVC) is the dedicated track of the Polsky Center’s nationally-ranked New Venture Challenge program. It supports University of Chicago College …",
        "newsletter_link": "mailto:polsky@uchicago.edu"
    },
    {
        "title": "About Us - Research Park",
        "link": "https://researchpark.illinois.edu/about/about-us/",
        "snippet": "EnterpriseWorks, the Park’s 43,000-square-foot business incubator for early-stage tech firms, is operated by the University of Illinois to help launch successful scientific and research-based …",
        "newsletter_link": "https://researchpark.illinois.edu/about/about-us/"
    },
    {
        "title": "University of Illinois Urbana-Champaign - Center for Innovation in ...",
        "link": "https://citl.illinois.edu/",
        "snippet": "The Center for Innovation in Teaching and Learning (CITL) breaks down this new and disruptive educational technology and its implications in teaching and learning and offers research-based …",
        "newsletter_link": "https://citl.illinois.edu/"
    },
    {
        "title": "Home - Research Park",
        "link": "https://researchpark.illinois.edu/",
        "snippet": "Jul 8, 2024 · Located on campus, the Research Park at the University of Illinois at Urbana-Champaign is a technology hub for corporate research and development operations and …",
        "newsletter_link": "https://researchpark.illinois.edu/"
    },
    {
        "title": "Home - Office of the Vice Chancellor of Research and Innovation",
        "link": "https://research.illinois.edu/",
        "snippet": "As one of the nation’s leading research institutions, the University of Illinois Urbana-Champaign has been shaping the future since 1867. Our research enterprise drives student …",
        "newsletter_link": "https://emails.illinois.edu/subscribe?emailId=1073162564"
    },
    {
        "title": "Apply - iVenture Accelerator",
        "link": "http://iventure.illinois.edu/apply/",
        "snippet": "Nov 13, 2023 · To qualify for the iVenture Accelerator, teams must have: 2-4 founders work in iVenture full-time for 10 weeks in the summer. Strong preference is given to students who are …",
        "newsletter_link": "http://iventure.illinois.edu/apply/"
    },
    {
        "title": "About Us - iVenture Accelerator",
        "link": "https://iventure.illinois.edu/about-us/",
        "snippet": "Founded in 2015, the iVenture Accelerator is the educational accelerator for student startups at the University of Illinois. The flagship program of the Origin Ventures Academy for …",
        "newsletter_link": "https://iventure.illinois.edu/about-us/"
    },
    {
        "title": "Home - UM - Innovation Partnerships - University of Michigan",
        "link": "https://innovationpartnerships.umich.edu/",
        "snippet": "At Innovation Partnerships we welcome great ideas – and they occur every day at the University of Michigan. We help you develop, protect, and advance your ideas for the market. We …",
        "newsletter_link": "http://eepurl.com/hKjdQr"
    },
    {
        "title": "Innovation Partnerships Startup Incubator - UM - University of …",
        "link": "https://innovationpartnerships.umich.edu/entrepreneurs/startup-incubator/",
        "snippet": "The Innovation Partnerships Startup Incubator provides resources to qualified U-M startups who are emerging from the pipeline of Ventures startup projects. The Incubator offers flexible …",
        "newsletter_link": "http://eepurl.com/hKjdQr"
    },
    {
        "title": "Desai Accelerator - Business Accelerator for Tech Startups",
        "link": "https://desaiaccelerator.umich.edu/",
        "snippet": "The Desai Accelerator offers an intensive, seven month program for tech-enabled startups. We provide the funding, mentorship, staff, and resources necessary for early-stage ventures to …",
        "newsletter_link": "mailto:desai-accelerator@umich.edu"
    },
    {
        "title": "Center for Entrepreneurship - University of Michigan's Center for ...",
        "link": "https://cfe.umich.edu/",
        "snippet": "The CFE’s mission is to unlock the full entrepreneurial potential at the University of Michigan by providing access to educational opportunities, immersive experiences, mentorship, and …",
        "newsletter_link": "javascript:;"
    },
    {
        "title": "ABOUT - Center for Entrepreneurship",
        "link": "https://cfe.umich.edu/about/",
        "snippet": "We are the CFE and we’re not your typical educational program. Our founder, Dr. Thomas Zurbuchen, had a vision to coach and inspire U-M students into an entrepreneurial mindset, …",
        "newsletter_link": "javascript:;"
    },
    {
        "title": "Ventures - UM - Innovation Partnerships - University of Michigan",
        "link": "https://innovationpartnerships.umich.edu/ventures/",
        "snippet": "Our Ventures team supports the launch of startups based on University of Michigan technologies and research discoveries. We provide a full suite of resources, services and …",
        "newsletter_link": "http://eepurl.com/hKjdQr"
    },
    {
        "title": "Entrepreneurs - UM - Innovation Partnerships - University of …",
        "link": "https://innovationpartnerships.umich.edu/entrepreneurs/",
        "snippet": "Discover our Startup Incubator and secure a dedicated lab and office space in close proximity to U-M Ventures resources, entrepreneurs, and mentors. Or explore funding opportunities and …",
        "newsletter_link": "http://eepurl.com/hKjdQr"
    },
    {
        "title": "University of Michigan-Flint College of Innovation & Technology",
        "link": "https://cit.umflint.edu/",
        "snippet": "Students who study at UM-Flint’s College of Innovation & Technology are acquiring the knowledge and skills they need to compete in the new landscape of jobs that require …",
        "newsletter_link": "https://cit.umflint.edu/"
    },
    {
        "title": "First tenants move into new Venture Accelerator for U-M startup ...",
        "link": "https://news.umich.edu/first-tenants-move-into-new-venture-accelerator-for-u-m-startup-businesses/",
        "snippet": "May 19, 2011 · The Venture Accelerator resembles a business incubator but is distinguished by the diverse array of services it offers to tenants—a suite of resources typically not available at …",
        "newsletter_link": "mailto:umichnews@umich.edu"
    },
    {
        "title": "U-M Desai Accelerator - Michigan Venture Capital Association",
        "link": "https://michiganvca.org/investor/u-m-desai-accelerator/",
        "snippet": "The Desai Accelerator is an intensive program of funding, mentorship, and resources to help early-stage ventures scale and succeed. Startups are accepted in cohorts, and the program …",
        "newsletter_link": "https://michiganvca.org/investor/u-m-desai-accelerator/"
    },
    {
        "title": "Center for Entrepreneurship - UM - Innovation Partnerships",
        "link": "https://innovationpartnerships.umich.edu/resource/center-for-entrepreneurship/",
        "snippet": "Center for Entrepreneurship. Entrepreneurs, Faculty. No matter your passion, interests, previous entrepreneurial experiences or ambitions, the Center for Entrepreneurship (CFE) …",
        "newsletter_link": "http://eepurl.com/hKjdQr"
    },
    {
        "title": "Home - Zell Lurie Institute",
        "link": "https://zli.umich.edu/",
        "snippet": "The Zell Lurie Institute provides students with the knowledge, skills, and motivation to achieve entrepreneurial success in a variety of settings. As they are guided through the process of new …",
        "newsletter_link": "https://umich.us12.list-manage.com/subscribe?u=920f0151da95f7b48a3d58cee&id=85c73c03ea"
    },
    {
        "title": "MTRAC Advanced Transportation awards more than $1.5M to …",
        "link": "https://news.umich.edu/mtrac-advanced-transportation-awards-more-than-1-5m-to-support-mobility-transportation-research/",
        "snippet": "2 days ago · The Michigan Translational Research and Commercialization Advanced Transportation Innovation Hub at the University of Michigan recently awarded more than …",
        "newsletter_link": "mailto:umichnews@umich.edu"
    },
    {
        "title": "U-M’s Innovation Partnerships awarded $5M to establish new …",
        "link": "https://news.umich.edu/u-ms-innovation-partnerships-awarded-5m-to-establish-new-statewide-venture-fund/",
        "snippet": "Jan 29, 2024 · The University of Michigan’s Innovation Partnerships has received $5 million from the Michigan Economic Development Corp. to establish the Michigan University Innovation …",
        "newsletter_link": "mailto:umichnews@umich.edu"
    },
    {
        "title": "Learn – Center for Entrepreneurship",
        "link": "https://cfe.umich.edu/learn/",
        "snippet": "Tech Acceleration. Discover support and infrastructures designed to fund and guide new ventures throughout the research and commercialization process. Access experiential education to gain …",
        "newsletter_link": "javascript:;"
    },
    {
        "title": "The Team – Center for Entrepreneurship",
        "link": "https://cfe.umich.edu/about/staff/",
        "snippet": "The Team – Center for Entrepreneurship. WE ARE INDUSTRIOUS. We are a group of innovative minds – makers, thinkers, explorers, storytellers, analysts, examiners, and creators …",
        "newsletter_link": "javascript:;"
    },
    {
        "title": "Faculty – Center for Entrepreneurship",
        "link": "https://cfe.umich.edu/about/faculty-bios/",
        "snippet": "The CFE brings together a diverse group of curious minds – inventors, dreamers, adventurers, visionaries, analysts, creatives, and collaborators – all with the shared goal of inspiring you to …",
        "newsletter_link": "javascript:;"
    },
    {
        "title": "Austin Technology Incubator - University of Texas at Austin",
        "link": "https://ati.utexas.edu/",
        "snippet": "The Austin Technology Incubator is the deep tech incubator affiliated with The University of Texas at Austin. ATI is a unit of Discovery to Impact at UT. Founded in 1989, ATI is also the …",
        "newsletter_link": "https://ati.utexas.edu/subscribe/"
    },
    {
        "title": "Entrepreneurship & Innovation | The University of Texas at Austin",
        "link": "https://www.utexas.edu/campus-life/entrepreneurship-and-innovation",
        "snippet": "Our cutting-edge programs, resources, events and opportunities have helped to establish UT Austin as an essential engine of the booming innovation and knowledge economy, and we're …",
        "newsletter_link": "https://ut.econnect.utexas.edu/texas-newsletter-signup"
    },
    {
        "title": "Students - Herb Kelleher Entrepreneurship Center",
        "link": "https://herbkellehercenter.mccombs.utexas.edu/students/",
        "snippet": "The ultimate measure of UT’s success is preparing leaders and transforming society. That’s why we’ve found dozens of ways to educate our student entrepreneurs, encourage student …",
        "newsletter_link": "https://herbkellehercenter.mccombs.utexas.edu/subscribe/"
    },
    {
        "title": "Global Innovation Lab | Texas Global",
        "link": "https://global.utexas.edu/innovation-lab",
        "snippet": "Global Innovation Lab works with government, universities and industry to train and support entrepreneurs in their communities.",
        "newsletter_link": "https://ut.econnect.utexas.edu/texas-global-stay-connected"
    },
    {
        "title": "Jon Brumley Texas Venture Labs - McCombs School of Business",
        "link": "http://www.mccombs.utexas.edu/centers-and-initiatives/jon-brumley-texas-venture-labs/",
        "snippet": "The Jon Brumley Texas Venture Labs Accelerator matches Austin-area startups with cross-functional teams of UT Austin graduate students for 10-week startup consulting projects. Our …",
        "newsletter_link": "http://bit.ly/TVL_Newsletter"
    },
    {
        "title": "UT Startup Ecosystem - Herb Kelleher Entrepreneurship Center",
        "link": "https://herbkellehercenter.mccombs.utexas.edu/ecosystem/",
        "snippet": "Co-working space that offers guidance for entrepreneurs by appointment, one-on-one mentorship, workshops, and curated information for students at the University of Texas.",
        "newsletter_link": "https://herbkellehercenter.mccombs.utexas.edu/subscribe/"
    },
    {
        "title": "Entrepreneurship Minor | Harkey Institute - McCombs School of …",
        "link": "http://www.mccombs.utexas.edu/centers-and-initiatives/harkey-institute-for-entrepreneurial-studies/entrepreneurship-minor/",
        "snippet": "The Entrepreneurship Minor develops students into innovative leaders. Our curriculum requires students to learn fundamental skills in ideation creation, business plans, marketing, pitching …",
        "newsletter_link": "https://airtable.com/shrJMHmriL3KUfTiU"
    },
    {
        "title": "University of Texas at Austin - Austin Technology Incubator – …",
        "link": "https://ati.utexas.edu/",
        "snippet": "The Austin Technology Incubator is the deep tech incubator affiliated with The University of Texas at Austin. ATI is a unit of Discovery to Impact at UT. Founded in 1989, ATI is also the …",
        "newsletter_link": "https://ati.utexas.edu/subscribe/"
    },
    {
        "title": "Entrepreneurship - University of Texas at Austin",
        "link": "https://cockrell.utexas.edu/student-life/entrepreneurship",
        "snippet": "At The University of Texas at Austin, entrepreneurship opportunities are at the heart of the student experience — with pitch competitions, business development mentorships, accelerator …",
        "newsletter_link": "https://utexas.qualtrics.com/jfe/form/SV_3w2gerDOlurQPU9"
    },
    {
        "title": "Apply – Austin Technology Incubator - University of Texas at Austin",
        "link": "https://ati.utexas.edu/apply/",
        "snippet": "Tell us about your company and innovation so we can decide whether ATI is right for you. ATI is the “deep tech” incubator of The University of Texas at Austin.",
        "newsletter_link": "https://ati.utexas.edu/subscribe/"
    },
    {
        "title": "Innovation, Creativity & Entrepreneurship | TEXAS …",
        "link": "https://undergradcollege.utexas.edu/bdp/programs/ice",
        "snippet": "The Innovation, Creativity & Entrepreneurship BDP helps you develop skills to bring *creative thinking* and an *entrepreneurial mindset* to your career goals, whether you’re interested in …",
        "newsletter_link": "mailto:UC_frontdesk@austin.utexas.edu"
    },
    {
        "title": "Home - Herb Kelleher Entrepreneurship Center",
        "link": "https://herbkellehercenter.mccombs.utexas.edu/",
        "snippet": "The Herb Kelleher Entrepreneurship Center invites you to join us for the Freed Family Pitch Competition Finals 2023! The Freed Family Pitch Competition (FFPC) is an annual competitive …",
        "newsletter_link": "https://herbkellehercenter.mccombs.utexas.edu/subscribe/"
    },
    {
        "title": "Homepage | Extended Education Ventures - University of Texas …",
        "link": "https://extendededucation.utexas.edu/",
        "snippet": "May 1, 2022 · Supporting UT Austin's Continuing & Professional Education Programs for Increased Impact",
        "newsletter_link": "mailto:eev@austin.utexas.edu"
    },
    {
        "title": "Master of Science in Technology Commercialization | MSTC",
        "link": "http://mccombs.utexas.edu/graduate/specialized-masters/ms-technology-commercialization/",
        "snippet": "The McCombs School of Business offers an innovative one-year Master of Science in Technology Commercialization program for entrepreneurs and product leaders. Sign Up for More Info.",
        "newsletter_link": "http://mccombs.utexas.edu/graduate/specialized-masters/ms-technology-commercialization/#d.en.36449"
    },
    {
        "title": "FAQ – Austin Technology Incubator - University of Texas at Austin",
        "link": "https://ati.utexas.edu/about/faq/",
        "snippet": "The Austin Technology Incubator (ATI) is the deep technology incubator of the University of Texas at Austin working with university and community entrepreneurs to commercialize their …",
        "newsletter_link": "https://ati.utexas.edu/subscribe/"
    },
    {
        "title": "UT Austin Named No. 2 Institution for Entrepreneurship Studies",
        "link": "https://news.utexas.edu/2023/11/13/ut-austin-named-no-2-institution-for-entrepreneurship-studies/",
        "snippet": "Nov 13, 2023 · UT Austin Named No. 2 Institution for Entrepreneurship Studies. The University of Texas at Austin continues to be known as one of the best universities for …",
        "newsletter_link": "mailto:?subject=UT%20Austin%20Named%20No.%202%20Institution%20for%20Entrepreneurship%20Studies&body=https%3A%2F%2Fnews.utexas.edu%2F2023%2F11%2F13%2Fut-austin-named-no-2-institution-for-entrepreneurship-studies%2F"
    },
    {
        "title": "Innovation, Creativity & Entrepreneurship - University of Texas at …",
        "link": "https://undergradcollege.utexas.edu/bdp/programs/ice",
        "snippet": "The Innovation, Creativity & Entrepreneurship BDP helps you develop skills to bring *creative thinking* and an *entrepreneurial mindset* to your career goals, whether you’re interested in …",
        "newsletter_link": "mailto:UC_frontdesk@austin.utexas.edu"
    },
    {
        "title": "Harkey Institute for Entrepreneurial Studies | McCombs School of …",
        "link": "https://entrepreneurship.mccombs.utexas.edu/",
        "snippet": "The Harkey Institute for Entrepreneurial Studies is the corner of Main and Main for undergraduate entrepreneurs at the University of Texas. This is where your story begins. We …",
        "newsletter_link": "mailto:entminor@utexas.edu"
    },
    {
        "title": "Austin Technology Incubator - Austin Technology Council",
        "link": "https://www.austintechnologycouncil.org/company/austin-technology-incubator/",
        "snippet": "The Austin Technology Incubator (ATI) is the deep technology incubator of The University of Texas at Austin, working with university and community entrepreneurs to commercialize their …",
        "newsletter_link": "https://www.austintechnologycouncil.org/company/austin-technology-incubator/"
    },
    {
        "title": "Texas Innovation Center - University of Texas at Austin",
        "link": "https://cockrell.utexas.edu/research/innovation-center",
        "snippet": "The Texas Innovation Center, located in the Engineering Education and Research Center, is the hub at The University of Texas at Austin for bringing engineering and science discoveries …",
        "newsletter_link": "https://utexas.qualtrics.com/jfe/form/SV_3w2gerDOlurQPU9"
    },
    {
        "title": "Austin Technology Incubator – Deep Tech Incubator from the …",
        "link": "https://ati.utexas.edu/",
        "snippet": "The Austin Technology Incubator is the deep tech incubator affiliated with The University of Texas at Austin. ATI is a unit of Discovery to Impact at UT. Founded in 1989, ATI is also the …",
        "newsletter_link": "https://ati.utexas.edu/subscribe/"
    },
    {
        "title": "UT Austin Ranks Among World’s Best for Producing Entrepreneurs",
        "link": "https://news.utexas.edu/2022/11/03/ut-austin-ranks-among-worlds-best-for-producing-entrepreneurs/",
        "snippet": "Nov 3, 2022 · AUSTIN, Texas — The University of Texas at Austin is one of the leading universities for producing future entrepreneurs, ranking No. 9 in the world for undergraduates …",
        "newsletter_link": "mailto:?subject=UT%20Austin%20Ranks%20Among%20World%E2%80%99s%20Best%20for%20Producing%20Entrepreneurs&body=https%3A%2F%2Fnews.utexas.edu%2F2022%2F11%2F03%2Fut-austin-ranks-among-worlds-best-for-producing-entrepreneurs%2F"
    },
    {
        "title": "The Innovation Imperative - UW Homepage",
        "link": "https://www.washington.edu/innovation/",
        "snippet": "Explore a selection of innovations developed wholly or in part at the University of Washington. We invite you to share in the UW’s rich history through these fundamental and groundbreaking …",
        "newsletter_link": "http://www.washington.edu/newsletter/"
    },
    {
        "title": "CoMotion Labs - CoMotion",
        "link": "https://comotion.uw.edu/startups-incubation/comotion-labs/",
        "snippet": "Jul 1, 2024 · CoMotion Labs is a multi-industry incubator for early-stage startups from the greater Seattle region, in addition to the UW community. From providing critical infrastructure to …",
        "newsletter_link": "https://comotion.uw.edu/comotion-newsletter-signup/"
    },
    {
        "title": "Jones + Foster Accelerator Program | Foster School of Business",
        "link": "https://foster.uw.edu/centers/buerk-ctr-entrepreneurship/jones-foster-accelerator-program/",
        "snippet": "The Jones + Foster Accelerator program aims to accelerate growth of early-stage, student-led companies through those decisive steps.",
        "newsletter_link": "https://foster.uw.edu/cdn-cgi/l/email-protection#9ee7ebf5f1f1fff5ebdeebe9b0fbfaeb"
    },
    {
        "title": "Arthur W. Buerk Center for Entrepreneurship - Foster School of …",
        "link": "https://foster.uw.edu/centers/buerk-ctr-entrepreneurship/",
        "snippet": "Founded in 1991, the Buerk Center offers an exceptional curriculum, real-world experiences, and connections to the Seattle entrepreneurial community to inspire students from all majors and …",
        "newsletter_link": "https://foster.uw.edu/centers/buerk-ctr-entrepreneurship/contact-us/"
    },
    {
        "title": "UW Innovation Month | The Innovation Imperative - UW Homepage",
        "link": "https://www.washington.edu/innovation/events-uw-innovation-month/",
        "snippet": "Browse innovation-related events listed below, including competitions, research symposia, lectures, exhibitions, concerts, and capstone showcases across disciplines, all month long.",
        "newsletter_link": "http://www.washington.edu/newsletter/"
    },
    {
        "title": "Startup Portfolio | The Innovation Imperative - UW Homepage",
        "link": "https://www.washington.edu/innovation/startups/",
        "snippet": "Today, there are 110 active UW spinoffs in the state of Washington with over 1,071 employees. In this same period, more than 450 startups have been launched by current undergraduate, …",
        "newsletter_link": "http://www.washington.edu/newsletter/"
    },
    {
        "title": "UW entrepreneurship programs place in the top 10 in national …",
        "link": "https://www.washington.edu/news/2023/11/07/foster-school-of-business-entrepreneurship-programs-place-in-the-top-10-in-national-ranking/",
        "snippet": "Nov 7, 2023 · Entrepreneurship programs at the University of Washington ranked in the top 10 for “Best Entrepreneurship Program,” according to a ranking produced jointly by The …",
        "newsletter_link": "https://www.washington.edu/#email"
    },
    {
        "title": "Startups & Incubation - CoMotion",
        "link": "https://comotion.uw.edu/startups-incubation/",
        "snippet": "We help entrepreneurs reach the next level with resources to license inventions, launch a business, or incubate a startup. We offer wraparound services to support startup success …",
        "newsletter_link": "https://comotion.uw.edu/comotion-newsletter-signup/"
    },
    {
        "title": "UW ranked No. 7 nationally for graduate entrepreneurship in 2021 ...",
        "link": "https://www.washington.edu/news/2020/11/19/uw-ranked-7-nationally-for-graduate-entrepreneurship-in-2021-princeton-review-rankings/",
        "snippet": "Nov 19, 2020 · A commitment to innovation powered the University of Washington to a No. 7 ranking for graduate entrepreneurship programs by The Princeton Review. The 2021 ranking …",
        "newsletter_link": "https://www.washington.edu/#email"
    },
    {
        "title": "Arthur W. Buerk Center for Entrepreneurship | Foster School of …",
        "link": "https://foster.uw.edu/centers/buerk-ctr-entrepreneurship/",
        "snippet": "Our accelerator helps early-stage, student-led companies get off the ground with six months of help from expert mentors and up to $25,000 in follow-on funding. Applications for the 2021 …",
        "newsletter_link": "https://foster.uw.edu/centers/buerk-ctr-entrepreneurship/contact-us/"
    },
    {
        "title": "UW Earns Historic National Entrepreneurship Ranking",
        "link": "https://blog.foster.uw.edu/entrepreneurship-ranking-uw-2024/",
        "snippet": "Nov 7, 2023 · A dedication to innovation at all levels earned the University of Washington a historic national ranking for entrepreneurship by the Princeton Review and Entrepreneur …",
        "newsletter_link": "https://foster.uw.edu/academics/degree-programs/master-of-science-in-entrepreneurship/contact-us/"
    },
    {
        "title": "5G Open Innovation Lab, CoMotion at the University of …",
        "link": "https://comotion.uw.edu/press_release/5g-open-innovation-lab-comotion-at-the-university-of-washington-and-t-mobile-collaborate-to-accelerate-5g-hardware-innovation/",
        "snippet": "SEATTLE, Wash. (Dec. 8, 2021) – 5G Open Innovation Lab (5G OI Lab), CoMotion at the University of Washington (UW), and T-Mobile today announced a collaboration that will enable …",
        "newsletter_link": "https://comotion.uw.edu/comotion-newsletter-signup/"
    },
    {
        "title": "UW Entrepreneurship 2022 Rankings from Princeton Review",
        "link": "https://blog.foster.uw.edu/entrepreneurship-uw-2022-ranking-princeton-review/",
        "snippet": "Nov 18, 2021 · The Princeton Review ranked the Univ. of Washington #8 for graduate entrepreneurship offerings and #26 overall for undergraduates for 2022.",
        "newsletter_link": "https://foster.uw.edu/academics/degree-programs/master-of-science-in-entrepreneurship/contact-us/"
    },
    {
        "title": "Dempsey Startup Competition | Foster School of Business",
        "link": "https://foster.uw.edu/centers/buerk-ctr-entrepreneurship/entrepreneurship-competitions/dempsey-startup-competition/",
        "snippet": "The Dempsey Startup Competition (Dempsey Startup), organized by the Buerk Center for Entrepreneurship, provides a real-world experience for student entrepreneurs, promoting …",
        "newsletter_link": "https://foster.uw.edu/cdn-cgi/l/email-protection#aed7dbc5c1c1cfc5dbeedbd980cbcadb"
    },
    {
        "title": "Venture Center | RIO - University of Minnesota",
        "link": "https://research.umn.edu/units/techcomm/startups/venture-center",
        "snippet": "Operate the Discovery Launchpad, a startup incubator and program of formal coaching for UMN innovators interested in forming a startup company; Facilitate equity-based investments …",
        "newsletter_link": "https://research.umn.edu/node/17357"
    },
    {
        "title": "Innovation Lab | University of Minnesota Genomics Center",
        "link": "https://genomics.umn.edu/general/innovation-lab",
        "snippet": "The UMGC Innovation Lab is a research group that operates within the University of Minnesota Genomics Center and develops novel tools and technologies for genomics research. Current …",
        "newsletter_link": "https://umn.qualtrics.com/jfe/form/SV_425w2G5kNTRfWuN"
    },
    {
        "title": "UMN & Launch Minnesota Collaborate to Form New Startup …",
        "link": "https://research.umn.edu/news/umn-launch-minnesota-collaborate-form-new-startup-incubator",
        "snippet": "Apr 26, 2021 · A new startup incubator program based at the University of Minnesota provides one-on-one coaching to help accelerate the growth of early-stage companies.",
        "newsletter_link": "https://research.umn.edu/node/17357"
    },
    {
        "title": "Incubator from University of Minnesota and Launch Minnesota …",
        "link": "https://research.umn.edu/units/techcomm/news/incubator-university-minnesota-and-launch-minnesota-announces-first-class",
        "snippet": "Apr 29, 2021 · The accelerator is open to any startup that has received an Innovation Grant from Launch Minnesota. It's an expansion of the U's existing Discovery Launchpad incubator, …",
        "newsletter_link": "https://research.umn.edu/node/17357"
    },
    {
        "title": "University of Minnesota, Launch Minnesota Announce New …",
        "link": "https://tech.mn/news/2021/05/03/university-of-minnesota-launch-minnesota-announce-new-startup-incubator",
        "snippet": "May 3, 2021 · The incubator, operated by the UMN Technology Commercialization Venture Center, offers recipients of Launch Minnesota Innovation Grants an opportunity for further …",
        "newsletter_link": "https://tcbmag.com/subscribe/"
    },
    {
        "title": "UEL | University Enterprise Laboratories",
        "link": "https://www.uelmn.org/",
        "snippet": "UEL is Minnesota’s leading life science incubator helping early-stage life science companies find lab space.",
        "newsletter_link": "https://www.uelmn.org/"
    },
    {
        "title": "UMGC Launches Innovation Lab - University of Minnesota",
        "link": "https://genomics.umn.edu/news/umgc-launches-innovation-lab",
        "snippet": "Led by Dr. Daryl Gohl, the Innovation Lab aims to establish an externally-funded research program by obtaining independent and collaborative grants from the NIH, NSF, and other …",
        "newsletter_link": "https://umn.qualtrics.com/jfe/form/SV_425w2G5kNTRfWuN"
    },
    {
        "title": "Home | Entre Club",
        "link": "https://www.entre-club.com/",
        "snippet": "Entrepreneurship Club at the University of Minnesota. Proudly created with Wix.com",
        "newsletter_link": "https://www.entre-club.com/"
    },
    {
        "title": "UEL is Minnesota’s leading life science incubator",
        "link": "https://www.uelmn.org/about-us/",
        "snippet": "Jun 28, 2024 · UEL is Minnesota’s leading life science incubator helping early-stage life science companies find lab space. UEL offers fertile ground where companies grow.",
        "newsletter_link": "https://www.uelmn.org/about-us/"
    },
    {
        "title": "StartMN | Twin Cities Business",
        "link": "https://tcbmag.com/category/startmn/",
        "snippet": "StartMN. Crafting Your Career Path. Advice for recent grads—and the rest of us—on turning goals and ambitions into reality. Entrepreneurship. Minneapolis Photographers Launch Brand …",
        "newsletter_link": "https://tcbmag.com/subscribe/"
    },
    {
        "title": "Meet Atland Ventures: The First-of-Its-Kind, Student-Run VC Firm …",
        "link": "https://tcbmag.com/meet-atland-ventures-the-first-of-its-kind-student-run-vc-firm-at-the-u-of-m/",
        "snippet": "Oct 16, 2018 · Atland Ventures was founded in 2016 by four U of M students (who have since graduated) — Sourish Ghosh, Harshil Chahal, David Brown and Samuel Bagley. Glaring …",
        "newsletter_link": "https://tcbmag.com/subscribe/"
    },
    {
        "title": "Top 10 Accelerators and Incubators in Minnesota in 2024 - Failory",
        "link": "https://www.failory.com/startups/minnesota-accelerators-incubators",
        "snippet": "Jan 24, 2024 · The staff of an accelerator or incubator can help by providing support, space, mentorship, connections and more. To help you out, we've compiled a list of 10 accelerators …",
        "newsletter_link": "https://www.failory.com/subscribe"
    },
    {
        "title": "EO Minnesota",
        "link": "https://www.eominnesota.org/",
        "snippet": "22 hours ago · Entrepreneurs' Organization - Minnesota provides countless opportunities to help entrepreneurs achieve new levels. Between our frequent events, peer-to-peer …",
        "newsletter_link": "https://www.eominnesota.org/"
    },
    {
        "title": "Office of Innovation & Commercialization",
        "link": "https://innovation.ucsd.edu/",
        "snippet": "We, at UC San Diego, are committed to forging a vibrant entrepreneurial community that radiates diversity, not only in embracing ideals, but in championing varied perspectives. Our mission is …",
        "newsletter_link": "https://signup.e2ma.net/signup/1938319/1927640/"
    },
    {
        "title": "New Technology Accelerator Launching at UC San Diego",
        "link": "https://jacobsschool.ucsd.edu/news/release/2157",
        "snippet": "The Institute for the Global Entrepreneur at the University of California San Diego is launching a unique Technology Accelerator to fast-track early stage, high impact technologies and …",
        "newsletter_link": "https://jacobsschool.ucsd.edu/news/subscribe"
    },
    {
        "title": "Entrepreneurship Center - University of California, San Diego",
        "link": "https://dib.ucsd.edu/entrepreneurship-center/index.html",
        "snippet": "Join the nexus of a vibrant creative ecosystem, entrepreneurial network and experiential learning. The Entrepreneurship Center serves as a nexus for our regional innovation …",
        "newsletter_link": "mailto:innovation@ucsd.edu"
    },
    {
        "title": "Startup – University of California, San Diego",
        "link": "https://ucsdec.com/startup/",
        "snippet": "What is UCSD Entrepreneurship Center? Located on-campus at UCSD, this is your exclusive space… the nexus of a vibrant, creative ecosystem, entrepreneurial network and experiential …",
        "newsletter_link": "https://ucsdec.com/startup/"
    },
    {
        "title": "University of California, San Diego",
        "link": "https://ucsdec.com/",
        "snippet": "#1. University of California system rank #1 in the world for international patent application. #2. UC San Diego is second in the University of California system for highest number of US patents. …",
        "newsletter_link": "https://ucsdec.com/"
    },
    {
        "title": "About Us | UCSD Rady School of Management",
        "link": "https://rady.ucsd.edu/why/centers/sullivan/about-us.html",
        "snippet": "The Sullivan Center for Entrepreneurship and Innovation at UC San Diego's Rady School of Management trains students, alumni, and researchers to see opportunities amid that …",
        "newsletter_link": "https://rady.ucsd.edu/why/centers/sullivan/about-us.html"
    },
    {
        "title": "MedTech Accelerator | Institute for the Global Entrepreneur",
        "link": "https://ige.ucsd.edu/medtech-accelerator",
        "snippet": "IGE is re-imagining the acceleration of Medical Innovation and Entrepreneurship. This program will help you navigate the complex processes of bringing medical innovations to market. …",
        "newsletter_link": "https://docs.google.com/forms/d/1elhDPqxJeI-CMNBY5mPU4gP1c3gpigQU9iuwldtAP8A/viewform?edit_requested=true"
    },
    {
        "title": "UCI Beall Applied Innovation – Innovation and Entrepreneurship …",
        "link": "https://innovation.uci.edu/",
        "snippet": "Whether you’re an undergrad or grad student, seasoned researcher or industry giant, our programs cultivate new ideas, startups, next-generation technologies and entrepreneurial …",
        "newsletter_link": "https://innovation.uci.edu/subscribe"
    },
    {
        "title": "Home - University Lab Partners",
        "link": "https://www.universitylabpartners.org/",
        "snippet": "An independent, non-profit, wet lab + medtech incubator. ULP was founded in partnership with the University of California Irvine Beall Applied Innovation. Our open innovation platform …",
        "newsletter_link": "https://www.universitylabpartners.org/"
    },
    {
        "title": "About UCI Beall Applied Innovation – UCI Beall Applied Innovation",
        "link": "https://innovation.uci.edu/about-uci-beall-applied-innovation/",
        "snippet": "Four core units within UCI Beall Applied Innovation focus on redefining the path of UCI entrepreneurship education, the mind-set of UCI researchers, and the University connection …",
        "newsletter_link": "https://innovation.uci.edu/subscribe"
    },
    {
        "title": "New Ventures Group – UCI Beall Applied Innovation",
        "link": "https://innovation.uci.edu/new-ventures-group/",
        "snippet": "New Ventures Group creates and provides programs and resources aimed at producing more successful outcomes for current and future generations of innovators and entrepreneurs. Tech …",
        "newsletter_link": "https://innovation.uci.edu/subscribe/"
    },
    {
        "title": "Master of Innovation and Entrepreneurship Overview - UCI",
        "link": "https://merage.uci.edu/programs/masters/master-innovation-entrepreneurship/index.html",
        "snippet": "The Master of Innovation and Entrepreneurship (MIE) provides extensive academic and practical experiences for those looking to accelerate their careers as entrepreneurs (innovating to form …",
        "newsletter_link": "https://merage.uci.edu/news/2023/04/123-Baby-Box-raises-oversubscribed-round-of-1.2-million.html"
    },
    {
        "title": "The UCI Entrepreneur Experience – UCI Beall Applied Innovation",
        "link": "https://innovation.uci.edu/2017/06/the-uci-entrepreneur-experience/",
        "snippet": "Jun 2, 2017 · The ANTrepreneur Center is often the first stop for students interested in entrepreneurship. It is the campus hub that helps the UCI community of students, staff, …",
        "newsletter_link": "https://innovation.uci.edu/subscribe"
    },
    {
        "title": "The Cove at UCI: Fostering Innovation & Entrepreneurship in OC",
        "link": "https://www.universitylabpartners.org/blog/the-cove-uci",
        "snippet": "The UCI Applied Innovation program is a forward-thinking initiative by UCI that aims to support the vibrant business community in Orange County by giving them access to campus-based …",
        "newsletter_link": "javascript:void(0);"
    },
    {
        "title": "UCI Startups – UCI Beall Applied Innovation",
        "link": "https://innovation.uci.edu/uci-startups/",
        "snippet": "Matchmaking high-school students with information about skilled-trade careers and providing leads to colleges. Hydroflow is a smart bottle cap and phone application that allows users to …",
        "newsletter_link": "https://innovation.uci.edu/subscribe"
    },
    {
        "title": "UCI Innovator Awards Recognize Distinguished Researchers and …",
        "link": "https://engineering.uci.edu/news/2021/10/uci-innovator-awards-recognize-distinguished-researchers-and-inventors",
        "snippet": "Iryna Zenyuk (left) won the Emerging Innovation/Early Career Innovator of the Year award and Sunny Jiang was named Innovator of the Year. Oct. 28, 2021 – Top researchers and faculty …",
        "newsletter_link": "https://engineering.uci.edu/#email"
    },
    {
        "title": "New Venture Competition | Paul Merage School of Business | UCI",
        "link": "https://merage.uci.edu/research-faculty/centers/innovation-entrepreneurship/new-venture-competiton.html",
        "snippet": "The UCI New Venture Competition offers you the opportunity to form a team, launch a startup and potentially fund a business idea – all within seven months. The competition is open to all …",
        "newsletter_link": "http://eepurl.com/ghRH79"
    },
    {
        "title": "Swartz Center for Entrepreneurship - Carnegie Mellon University",
        "link": "https://www.cmu.edu/swartz-center-for-entrepreneurship/",
        "snippet": "The Swartz Center for Entrepreneurship at Carnegie Mellon University is a system of programs and activities that offers a unique path of entrepreneurship education, engagement, …",
        "newsletter_link": "https://signup.e2ma.net/signup/1719631/28031/?v=a"
    },
    {
        "title": "Graduate Entrepreneurship Club - Carnegie Mellon University",
        "link": "https://www.cmu.edu/swartz-center-for-entrepreneurship/get-involved/student-clubs/gec/index.html",
        "snippet": "The Graduate Entrepreneurship Club (GEC) supports founders and future CEOs, but we believe that entrepreneurship is so much more. Entrepreneurship is a mindset, and we want to …",
        "newsletter_link": "https://mailchi.mp/942cfdfdbcfc/signup-form"
    },
    {
        "title": "Swartz Center Entrepreneurship Bootcamp 2023",
        "link": "https://community.cmu.edu/customquickevents?id=a3p2S000000NRon&custom=true",
        "snippet": "Sep 9, 2023 · Join us for this one-day glimpse into entrepreneurship at CMU and Pittsburgh. Saturday, September 9, 2023 1:00 - 5:00 PM EDT/EST* Swartz Center for Entrepreneurship, …",
        "newsletter_link": "https://community.cmu.edu/customquickevents?id=a3p2S000000NRon&custom=true"
    },
    {
        "title": "Undergraduate Additional Major - Carnegie Mellon University",
        "link": "https://www.cmu.edu/iii/undergrad-edie/index.html",
        "snippet": "The Engineering Design, Innovation, and Entrepreneurship (EDIE) additional undergraduate major will provide students the know-how to pioneer products around technology and deliver …",
        "newsletter_link": "mailto:edie-iii@andrew.cmu.edu"
    }
]